app/controllers/calendars_controller.rb

    def set_calendar
      @calendar = Calendar.find(params[:calendar_date])
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."calendar_date" = $1 LIMIT $2  [["calendar_date", "2020-05-06"], ["LIMIT", 1]]