app/controllers/photos_controller.rb

INSERT INTO "photos" ("img_date", "img_src", "created_at", "updated_at", "journal_entry") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["img_date", "2020-05-06"], ["img_src", "meh"], ["created_at", "2020-05-11 22:52:40.286551"], ["updated_at", "2020-05-11 22:52:40.286551"], ["journal_entry", "meh happened"]]
---
  def create
    @photo = Photo.new(photo_params)

    if @photo.save

UPDATE "photos" SET "img_src" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["img_src", "https://www.aljazeera.com/mritems/Images/2020/4/10/76ef7ec3c7dd4f318d97fd16a6168a51_6.jpg"], ["updated_at", "2020-05-11 23:31:55.713637"], ["id", 3]]
---
  def update
    if @photo.update(photo_params)